results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf5-isr3-msg1024-tps1000-batch131072-acks1-prod12-complz4-trial3/producer-perf-4.log
producer_index=4
producer_count=12
producer_records=8334
producer_throughput=84
1 records sent, 0.1 records/sec (0.00 MB/sec), 13913.0 ms avg latency, 13913.0 ms max latency.
1594 records sent, 318.2 records/sec (0.31 MB/sec), 1974.0 ms avg latency, 3065.0 ms max latency.
425 records sent, 84.7 records/sec (0.08 MB/sec), 66.7 ms avg latency, 458.0 ms max latency.
424 records sent, 84.7 records/sec (0.08 MB/sec), 23.1 ms avg latency, 80.0 ms max latency.
421 records sent, 84.0 records/sec (0.08 MB/sec), 15.1 ms avg latency, 61.0 ms max latency.
421 records sent, 84.0 records/sec (0.08 MB/sec), 16.2 ms avg latency, 74.0 ms max latency.
422 records sent, 84.3 records/sec (0.08 MB/sec), 13.9 ms avg latency, 43.0 ms max latency.
422 records sent, 84.3 records/sec (0.08 MB/sec), 13.5 ms avg latency, 43.0 ms max latency.
421 records sent, 84.1 records/sec (0.08 MB/sec), 13.1 ms avg latency, 53.0 ms max latency.
421 records sent, 83.9 records/sec (0.08 MB/sec), 13.0 ms avg latency, 49.0 ms max latency.
422 records sent, 84.3 records/sec (0.08 MB/sec), 11.9 ms avg latency, 52.0 ms max latency.
420 records sent, 83.8 records/sec (0.08 MB/sec), 12.5 ms avg latency, 51.0 ms max latency.
421 records sent, 84.2 records/sec (0.08 MB/sec), 12.3 ms avg latency, 72.0 ms max latency.
421 records sent, 84.1 records/sec (0.08 MB/sec), 12.2 ms avg latency, 37.0 ms max latency.
420 records sent, 83.2 records/sec (0.08 MB/sec), 11.1 ms avg latency, 45.0 ms max latency.
425 records sent, 85.0 records/sec (0.08 MB/sec), 11.7 ms avg latency, 38.0 ms max latency.
420 records sent, 84.0 records/sec (0.08 MB/sec), 12.1 ms avg latency, 39.0 ms max latency.
8334 records sent, 83.735230 records/sec (0.08 MB/sec), 392.90 ms avg latency, 13913.00 ms max latency, 14 ms 50th, 2605 ms 95th, 3027 ms 99th, 3064 ms 99.9th.